Revit 2024 API
AnalysisResultSchema.GetNumberOfUnits Method
 returns number of possible units
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public int GetNumberOfUnits()
Visual Basic
Public Function GetNumberOfUnits As Integer
Visual C++
public:
int GetNumberOfUnits()
See Also
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace